{"project":{"id":17742,"lastUpdated":"2018-10-10","title":"Space Evaporator Absorber Radiator for Life Support and Thermal Control Systems, Phase I","status":"Completed","startDate":"Jun 2014","endDate":"Dec 2014","description":"Future human space exploration missions will require advanced life support technology that can operate across a wide range of applications and environments.  Thermal control systems for space suits and spacecraft will need to meet critical requirements for water conservation and adaptability to highly variable thermal environments.  To achieve these goals, we propose an International Space Station (ISS) demonstration program for an innovative Space Evaporator Absorber Radiator (SEAR) technology.  A SEAR system comprises a lithium chloride absorber radiator (LCAR) for heat rejection coupled with a space water membrane evaporator (SWME) for heat acquisition.  SEAR systems provide heat pumping to minimize radiator size, thermal storage to accommodate variable environmental conditions, and water absorption to minimize use of expendables.  In Phase I we will prove the feasibility of our approach by building and testing an LCAR with flight-like internal structures and designing an ISS demonstration experiment.  In Phase II we will design and build a SEAR test module according to ISS flight requirements and demonstrate its operation in ground tests that simulate flight test conditions.","benefits":"Potential NASA Commercial Applications: There are two primary NASA applications for the SEAR technology.  (1) Nonventing thermal control systems for space suits.  SEAR can be used to provide a temperature control system that rejects heat by radiation instead of venting water vapor.  The advanced LCAR design we demonstrate in this program can provide a multifunctional structure and double as the shell that houses the portable life support system backpack.  Nonventing thermal control systems for spacecraft, particularly spacecraft such as lunar orbiters that must accommodate highly variable thermal environments.  (2) Nonventing thermal control and thermal storage system for manned spacecraft.  SEAR technology can enable lunar orbiters and other spacecraft that must operate in highly variable thermal environments a system for high-efficiency thermal energy storage and heat rejection without venting water.","technologyMaturityStart":"4","technologyMaturityCurrent":"4","technologyMaturityEnd":"4","responsibleProgram":"SBIR/STTR","responsibleMissionDirectorateOrOffice":"Space Technology Mission Directorate","leadOrganization":{"name":"Glenn Research Center","type":"NASA Center","acronym":"GRC","city":"Cleveland","state":"OH","country":"United States"},"workLocations":["New Hampshire","Ohio"],"programDirectors":["Jennifer L Gustetic"],"programManagers":["Carlos Torrez"],"projectManagers":["Grant Bue"],"principalInvestigators":["Michael G Izenson"],"libraryItems":[{"id":5006,"title":"Project Image","type":"Image","description":"Space Evaporator Absorber Radiator for Life Support and Thermal Control Systems Project Image","externalUrl":null,"publishedBy":null,"publishedDate":null,"files":[{"id":4690,"url":"https://techport.nasa.gov/file/4690","size":111168}]}],"closeoutDocuments":["https://techport.nasa.gov/file/14392"],"primaryTas":[{"id":10527,"code":"TA14","title":"Thermal Management Systems","priority":null},{"id":8830,"code":"TA14.2","title":"Thermal Control Systems","priority":null},{"id":8955,"code":"TA14.2.3","title":"Heat Rejection and Energy Storage","priority":null}],"additionalTas":[{"id":10527,"code":"TA14","title":"Thermal Management Systems","priority":null},{"id":8830,"code":"TA14.2","title":"Thermal Control Systems","priority":null},{"id":8953,"code":"TA14.2.2","title":"Heat Transport","priority":null}],"supportingOrganizations":[{"name":"Creare LLC","type":"Industry","acronym":null,"city":"Hanover","state":"NH","country":"United States"},{"name":"Creare, Inc.","type":"Industry","acronym":null,"city":"Hanover","state":"NH","country":"United States"}]}}